#include <stdio.h>

// ป้อนข้อมูล 2 จำนวน แล้วแสดงผล 2 บรรทัด ตามที่กำหนด ต่อไปนี้
// โดยบรรทัดที่ 1 แสดงค่าที่น้อยก่อนแล้วตามด้วยค่าที่มาก
// โดยบรรทัดที่ 1 แสดงค่าที่มากก่อนแล้วตามด้วยค่าที่น้อย
// หากมีค่าเท่ากันให้แสดงว่า equal

int main() {
   int a, b;
   scanf("%d", &a);
   scanf("%d", &b);

   if(a == b) {
      printf("equal\n");
      return 0;
   }

   printf("%d%d\n", (a > b) ? b : a, (a > b) ? a : b);
   printf("%d%d\n", (a > b) ? a : b, (a > b) ? b : a);
   
   return 0;
}